data_generation/simulation_results/case_64/0/fluid/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       volVectorField;
    location    "0/fluid";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

#include "../../constant/simParams"

internalField   uniform ($Ux 0 0);

boundaryField
{
    empty
    {
        type            empty;
    }
    walls
    {
        type            noSlip;
    }
    inlet
    {
        type            fixedValue;
	value		$internalField;
    }
    outlet
    {
        type            zeroGradient;
    }
    "fluid_to_component_.*"
    {
        type            noSlip;
        value           uniform (0 0 0);
    }
    fluid_to_pcb
    {
        type            noSlip;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
