data_generation/simulation_results/case_64/constant/simParams
nIter 2000;
hComponent0 3399.5845880995294;
hComponent1 3942.0514964399285;
hComponent2 3966.302566915376;
hComponent3 3472.295577527559;
hComponent4 3268.2124159291175;kComponent0 19.194607012929424;
kComponent1 58.655559501360145;
kComponent2 14.99856921962332;
kComponent3 46.484065258178696;
kComponent4 32.78508174327909;
tAmbient 300;
Ux 1.8969448408947764;
kPCB 0.2974876995340403;